Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # cloudflare_filter.transmission will be updated in-place
~ resource "cloudflare_filter" "transmission" {
        description = "Limit access to Portainer and Transmission to Docker network, server itself, home and office IPs"
      ~ expression  = <<~EOT
            (
              http.host in {"portainer.milanvit.net" "transmission.milanvit.net"}
              and not (
          -     ip.src in {172.17.0.0/16 111.98.60.102 117.109.64.7 148.251.233.134 183.76.253.231 122.218.87.26 122.218.87.66}
          +     ip.src in {172.17.0.0/16 111.98.60.102 148.251.233.134 183.76.253.231 122.218.87.26 122.218.87.66}
                or http.request.uri.path contains "/.well-known/acme-challenge/"
              )
            )
        EOT
        id          = "6e4e0860de6a4fa2a7bcccb6e8269747"
        paused      = false
        zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["drone"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "drone"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "milanvit.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["drone-runner"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "drone-runner"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "milanvit.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["gitea"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "gitea"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 3600
      + type        = "CNAME"
      + value       = "milanvit.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["kaji"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "kaji"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "milanvit.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["office"] will be updated in-place
~ resource "cloudflare_record" "milanvit_net_cname" {
        created_on  = "2020-06-22T00:14:20.542242Z"
        data        = {}
        hostname    = "office.milanvit.net"
        id          = "dace2fe1821b4585a82e9d3e1141e486"
        metadata    = {
            "auto_added"             = "false"
            "managed_by_apps"        = "false"
            "managed_by_argo_tunnel" = "false"
            "source"                 = "primary"
        }
        modified_on = "2020-06-22T00:14:20.542242Z"
        name        = "office"
        priority    = 0
        proxiable   = true
      ~ proxied     = false -> true
        ttl         = 1
        type        = "CNAME"
        value       = "milanvit.net"
        zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["phantomjs"] will be created
+ resource "cloudflare_record" "milanvit_net_cname" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "phantomjs"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "milanvit.net"
      + zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

Plan: 5 to add, 2 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.milanvit.net/lock?id=Cellane%252Fmilanvit.net%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
